package linkedLists

/**
 * Копирование
 *  1. Создаём новый список
 *  2. Выделяем поле для помледнего добавленного элемента
 *  3. В процессе обхода старого добавляем в последний добавленный элемент новый, пока не закончится список.
 *
 *  Сортировка вставкой
 *  1. Создаём новый список
 *  2. В процессе обхода старого в новый вставляем элементы согласно условию сортировки
 *
 *  Сортировка выборкой
 *  1. Создаём новый список
 *  2. Ищем в старом максимальный или минимальный элемент согласно условию сортировки
 *  3. Перемещаем его в начало нового списка
 *  4. Повторяем
 * */